output/auto_research/qwen3.5-27b-responses-sdk-adapter-cutover-heavy-l0c-mutation-fp8_gemm-20260503T021359Z/candidates/aborted_preflight_mismatch_004b/mutation.patch
--- /home/mark/shared/lumoFlyWheel/src/lumo_flywheel_serving/kernel_overlays/fp8_gemm_cutlass_overlay_bootstrap.py	2026-05-03 03:37:44.132445545 +0000
+++ /dev/fd/63	2026-05-03 03:41:34.977865197 +0000
@@ -18,6 +18,12 @@
             "vllm.model_executor.kernels.linear.scaled_mm.cutlass",
             "vllm.model_executor.layers.quantization.kernels.scaled_mm.cutlass",
         ],
-        "source_replacements": [],
+        "source_replacements": [
+            {
+                "label": "comment_only_fp8_cutlass_decode_bandwidth_marker",
+                "before": "        # Fused GEMM_DQ\n",
+                "after": "        # Fused GEMM_DQ  # L0c: preserve wrapper bytecode for parity\n",
+            }
+        ],
     },
 }
